GroundEffectSST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.5629094789408697; 
boundaryField
{
    Inlet
    {
      type              inletOutlet;
      inletValue        $internalField;
    }

    Outlet
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }
    
    Airfoil
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
    Ground
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }
}


// ************************************************************************* //
